Обработки/Reports/_ПереченьСделокИДвиженияДенежныхСредств_ГруппаБудущее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ПереченьСделокИДвиженияДенежныхСредств_ГруппаБудущее</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВФорматеCSV</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ПереченьСделокИДвиженияДенежныхСредств_ГруппаБудущее/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
		
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		Отчет.Период.ДатаНачала = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
		Отчет.Период.ДатаОкончания = КонецДня(Отчет.Период.ДатаНачала);
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета) 
		И ЭтаФорма.НастройкиОтчета.Свойство("ВариантОтчета") 
		И ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
		
		ЭтаФорма.КлючТекущегоВарианта = ЭтаФорма.НастройкиОтчета.ВариантОтчета;
		
	КонецЕсли; 
	
	РаботаСОтчетами.ЗаполнитьВариантОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтаФорма.Отчет, ЭтаФорма.КлючТекущегоВарианта);		
	
	ИмяПредопределенного	= РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтаФорма.Отчет);
	ПредставлениеВарианта	= РаботаСОтчетамиКлиентСервер.ПолучитьПредставлениеВариантаОтчета(ЭтаФорма.Отчет);	
		
	Если ЗначениеЗаполнено(ПредставлениеВарианта) Тогда
		ЭтаФорма.Заголовок = ПредставлениеВарианта;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
		ЭтаФорма.ВариантМодифицирован = Ложь;
	КонецЕсли;
	ВФорматеCSVПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Формы

&НаКлиенте
Процедура ПутьВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Отчет.КаталогДанных; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Отчет.КаталогДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Отчет.КаталогДанных + "\");

КонецПроцедуры

&НаКлиенте
Процедура ВФорматеCSVПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.КаталогДанных.Видимость = Отчет.ВФорматеCSV;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат"], "НЕАКТУАЛЬНОСТЬ");
		
КонецПроцедуры

#КонецОбласти

#Область Автоматическое_Формирование

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтаФорма.Отчет, ЭтаФорма.КлючТекущегоВарианта);
	
	СкомпоноватьРезультат();
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
